### Data cleaning on Titanic Data - #30DaysofDataScience

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('./titanic/data.csv')

### Data Discovery - Correct Data

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [4]:
df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [5]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
df.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [7]:
df.sample(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
193,1085,2,"Lingane, Mr. John",male,61.0,0,0,235509,12.35,NaN,Q
294,1186,3,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.50,NaN,S
325,1217,3,"Assam, Mr. Ali",male,23.0,0,0,SOTON/O.Q. 3101309,7.05,NaN,S
213,1105,2,"Howard, Mrs. Benjamin (Ellen Truelove Arman)",female,60.0,1,0,24065,26.00,NaN,S
89,981,2,"Wells, Master. Ralph Lester",male,2.0,1,1,29103,23.00,NaN,S

In [8]:
df['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [9]:
df['Fare'].max()

512.3292

### Data Coverage

In [10]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Length: 418, dtype: bool

In [11]:
df['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [12]:
df['Pclass'].value_counts()

3    218
1    107
2     93
Name: Pclass, dtype: int64

### Consistency
#### Consistent Labels
- Label formatted the same way
- Labels describe the same thing
- Labels are human-understandable

### Count
#### How Much Data
- More data = Good
- More good data = Good
- Better data, better prediction

### Ethics
#### Ethical Concerns
- Where did the data come from?
- How was the data collected amd from who/what?
- Does the data represent the population fairly?
- What was the process in creating labels for the data

### Data Cleaning
#### Handling missing values
- understand how much data is missing
- Understand why they are missing/pattern
- Remove the missing rows
- Fill with other values: Average/Mean, Similar classes or Median

### Finding Missing Data

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

### Replace the missing data with the average Age

In [14]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [15]:
df[['Name','Age']]

                                             Name       Age
0                                Kelly, Mr. James  34.50000
1                Wilkes, Mrs. James (Ellen Needs)  47.00000
2                       Myles, Mr. Thomas Francis  62.00000
3                                Wirz, Mr. Albert  27.00000
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.00000
..                                            ...       ...
413                            Spector, Mr. Woolf  30.27259
414                  Oliva y Ocana, Dona. Fermina  39.00000
415                  Saether, Mr. Simon Sivertsen  38.50000
416                           Ware, Mr. Frederick  30.27259
417                      Peter, Master. Michael J  30.27259

[418 rows x 2 columns]

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [17]:
df['Age']

0      34.50000
1      47.00000
2      62.00000
3      27.00000
4      22.00000
         ...
413    30.27259
414    39.00000
415    38.50000
416    30.27259
417    30.27259
Name: Age, Length: 418, dtype: float64

In [18]:
df['Age'].mean()

30.272590361445815

In [19]:
df['Age'].min()

0.17

In [20]:
df['Age'].max()

76.0

### Rounding Age - Can be used for age ranges

In [21]:
df['Age'].min()

0.17

In [22]:
df['Age'] = df['Age'].apply(np.ceil)

In [23]:
df['Age'].min()

1.0

In [24]:
df['Age']

0      35.0
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    31.0
414    39.0
415    39.0
416    31.0
417    31.0
Name: Age, Length: 418, dtype: float64

In [25]:
df['Age'].min()

1.0

### Dropping the unembarked

In [33]:
# df['Embarked'].to_list()

In [27]:
df = df.dropna(how='any', subset='Embarked')

In [29]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,35.0,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,31.0,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,39.0,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,31.0,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,31.0,1,1,2668,22.3583,NaN,C

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

### Dropping the Cabin column

In [31]:
df.drop(columns='Cabin', inplace=True)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB

### Other useful cleaning method
- np.where(where, then, else) - Cleaning up Inconsistent labels
- df.drop_duplicates() - drop duplicate values
- df.rename(columns=new_names, inplace=True) - Renaming columns and rows

#### Handling Bad Label

- Find using pynum
- Ensure labels are describing the same data
- Replace with correct label

### Handling Bad Coverage
- Understand Distribution
- Investigate the Reasons
- Group less represented labels together

### Understanding Datasets
- Feature to be used
- Predictions to be made

In [35]:
type(df)

pandas.core.frame.DataFrame